'''
6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит
информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно,
т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[

(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})

]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например
название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{

“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]

}
'''

prod_chrct = {
    "название": "str",
    "цена": "float",
    "количество": "int",
    "ед": "str"
}

all_prod = []

amnt_prod = int(input("Количество товара: "))

for i in range(amnt_prod):
    one_prod = {}
    print(f'{"-" * 6} Товар №{i + 1} {"-" * 6}')
    for name_chrct, type_chrct in prod_chrct.items():
        if type_chrct == "int":
            one_prod[name_chrct] = int(input(f'Ведите {name_chrct} товара: '))
        elif type_chrct == "float":
            one_prod[name_chrct] = float(input(f'Ведите {name_chrct} товара: '))
        else:  # str
            one_prod[name_chrct] = input(f'Ведите {name_chrct} товара: ')
    all_prod.append(tuple([i + 1, one_prod]))

#all_prod = [(1, {'название': 'Чай', 'цена': 34.0, 'количество': 4, 'ед': 'шт'}),
#            (2, {'название': 'Молоко', 'цена': 19.0, 'количество': 7, 'ед': 'шт'}),
#            (3, {'название': 'Квас', 'цена': 87.0, 'количество': 2, 'ед': 'шт'})]
print(f'{"-" * 6} Структура {"-" * 6}')
print(all_prod)

analytics = {}
for name_chrct in prod_chrct:
    sum_chrct = []
    for el in all_prod:
        sum_chrct.append(el[1][name_chrct])
    sum_chrct = list(set(sum_chrct))
    analytics[name_chrct] = sum_chrct

print(f'{"-" * 6} Аналитика {"-" * 6}')
print(analytics)
