'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима,
весна, лето, осень). Напишите решения через list и через dict.
'''

month = 0
while not 0 < month <= 12:
    try:
        month = int(input("Введите число месяц (от 1 до 12): "))
    except:
        print("Что-то пошло не так, попробуй ещё раз.")

# Вариант №1
seasons_1 = {12: "зима", 1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето",
             9: "осень", 10: "осень", 11: "осень"}
print(seasons_1[month])

# Вариант №2
seasons_2 = {"зима": [1, 2, 12], "весна": [3, 4, 5], "лето": [6, 7, 8], "осень": [9, 10, 11]}
for key, val in seasons_2.items():
    if month in val:
        print(key)
